{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 768,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "affirm",
    "1": "bye",
    "2": "check_battery_range",
    "3": "check_battery_status",
    "4": "check_ride_stats",
    "5": "check_station_availability",
    "6": "check_subscription",
    "7": "deny",
    "8": "find_swap_station",
    "9": "greet",
    "10": "help_general",
    "11": "make_payment",
    "12": "payment_history",
    "13": "payment_inquiry",
    "14": "report_issue",
    "15": "station_directions",
    "16": "subscription_renewal",
    "17": "swap_count",
    "18": "swap_history",
    "19": "talk_to_agent",
    "20": "thank",
    "21": "unknown",
    "22": "upgrade_subscription"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "affirm": 0,
    "bye": 1,
    "check_battery_range": 2,
    "check_battery_status": 3,
    "check_ride_stats": 4,
    "check_station_availability": 5,
    "check_subscription": 6,
    "deny": 7,
    "find_swap_station": 8,
    "greet": 9,
    "help_general": 10,
    "make_payment": 11,
    "payment_history": 12,
    "payment_inquiry": 13,
    "report_issue": 14,
    "station_directions": 15,
    "subscription_renewal": 16,
    "swap_count": 17,
    "swap_history": 18,
    "talk_to_agent": 19,
    "thank": 20,
    "unknown": 21,
    "upgrade_subscription": 22
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.6",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 197285
}
